{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "concat_axis": -1, "output_shape": null, "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.2, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "unroll": false, "recurrent_constraint": null, "name": "lstm_1", "recurrent_regularizer": null, "units": 300, "batch_input_shape": [null, 30, 300], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "unit_forget_bias": true, "go_backwards": false, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.2, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "unroll": false, "recurrent_constraint": null, "name": "lstm_2", "recurrent_regularizer": null, "units": 300, "batch_input_shape": [null, 30, 300], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "unit_forget_bias": true, "go_backwards": false, "trainable": true}}]}], "output_mask": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_dropout": 0.2, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "unit_forget_bias": true, "go_backwards": false, "units": 300}}, {"class_name": "LSTM", "config": {"return_sequences": true, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_dropout": 0.2, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "unit_forget_bias": true, "go_backwards": false, "units": 300}}], "keras_version": "2.0.3"}