{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"output_layers": [["time_distributed_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 30, 101], "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 30, 101], "name": "input_2", "sparse": false}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": true, "bias_regularizer": null, "name": "A1_layer1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.15, "units": 101, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.15, "recurrent_activation": "hard_sigmoid", "implementation": 0, "recurrent_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}}, "name": "bidirectional_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": true, "bias_regularizer": null, "name": "B_layer1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.15, "units": 101, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.15, "recurrent_activation": "hard_sigmoid", "implementation": 0, "recurrent_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}}}, "name": "bidirectional_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": true, "bias_regularizer": null, "name": "A1_layer2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.15, "units": 202, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.15, "recurrent_activation": "hard_sigmoid", "implementation": 0, "recurrent_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}, "name": "A1_layer2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": true, "bias_regularizer": null, "name": "B_layer2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.15, "units": 202, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.15, "recurrent_activation": "hard_sigmoid", "implementation": 0, "recurrent_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}, "name": "B_layer2", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["A1_layer2", 0, 0, {}], ["B_layer2", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"activation": "tanh", "return_sequences": true, "bias_regularizer": null, "name": "A2_layer1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.15, "units": 404, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.15, "recurrent_activation": "hard_sigmoid", "implementation": 0, "recurrent_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false}, "name": "A2_layer1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "name": "A2_layer2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 10003}}}, "name": "time_distributed_1", "inbound_nodes": [[["A2_layer1", 0, 0, {}]]]}]}}